// Copyright (c) 2015-present Workspace, Inc. All Rights Reserved.
// See LICENSE.txt for license information.

import React, {useState} from 'react';

import {SecurityFeature} from './FeatureButton';
import '../styles/main.scss';

const features = [
    {
        id: '1',
        title:
      'منصة مراسلات قائمة على مبدأ القنوات للويب، الجهاز مكتبي وحتى للهاتف النقال',
        description: [
            'المراسلة، مشاركة الملفات، ومعاينة الروابط والملفات عبر مختلف الأجهزة تسهيل التواصل ونقل الملفات بين المستخدمين على مختلف المنصات.',
            'محرك بحث أساسي يعزز سهولة الوصول إلى المحتوى يتيح الوصول السريع إلى المعلومات داخل المحادثات.',
            'إجراء مكالمات صوتية فردية، مع دعم لمشاركة الشاشة تواصل مباشر يدعم الاجتماعات عن بعد والعروض التقديمية.',
            'تخصيص العلامة التجارية، السمات، والرموز التعبيرية حسب الرغبة مرونة في تصميم الواجهة بما يتناسب مع هوية المؤسسة.',
            'إجراء مكالمات صوتية فردية، مع دعم لمشاركة الشاشة تواصل مباشر يدعم الاجتماعات عن بعد والعروض التقديمية.',
            'مناقشات متسلسلة تضمن تنظيماً فعالاً للمحادثات تنظيم المحادثات بشكل متسلسل لتسهيل تتبع المواضيع والنقاشات.',
            'دعم متاح بـ 20 لغة لتجربة شاملة عالمية الوصول إلى المستخدمين في جميع أنحاء العالم مع دعم لغات متعددة.',
        ],
    },
    {
        id: '2',
        title: '  بيئة تعاون ذكية مدعومة بالذكاء الاصطناعي',
        description: [
            'دعم تفاعلي للروبوتات المعتمدة على الذكاء الاصطناعي توفير مساعدات ذكية تفاعلية تساهم في تحسين التواصل والإنتاجية.',
            'تشغيل الذكاء الاصطناعي في بيئات مغلقة وآمنة (DDIL) يتيح تشغيل العمليات في بيئات معزولة ومحكمة لتأمين البيانات الحساسة.',
            'تكامل مرن مع نماذج الذكاء الاصطناعي المخصصة يسمح باستخدام وتكامل نماذج الذكاء الاصطناعي الخاصة بالشركات حسب احتياجاتها.',
            'إحاطة فورية للقنوات يوفر تحديثات مستمرة وتلقائية للمستخدمين حول مستجدات المحادثات والقنوات.',
            'تلخيص وتكوين محتوى سياقي يقدم أدوات تساعد في تلخيص وتقديم محتوى متناسق بناءً على سياق المحادثات.',
            'إمكانية طرح الأسئلة على أنظمة خلفية ذات وصول محدود يوفر دعم الاستفسارات مع ضمان أمان البيانات والحماية من الوصول غير المصرح به.',
            'وضع التتبع الكامل الاختياري (تجريبي) يقدم خيارًا لتتبع شامل لمزيد من التحكم والتحليل التجريبي.',
        ],
    },
    {
        id: '3',
        title: '           الدعم والتكامل التشغيلي والتقني',
        description: [
            'منصة تكامل متعددة الاستخدامات تسهل الربط بين النظام الأساسي وأدوات العمل الأخرى لتعزيز التعاون.',
            'تكاملات متقدمة مع العمليات التشغيلية و DevOps توفر دعمًا مباشرًا للتكامل مع أنظمة DevOps لضمان سير عمل مستدام.',
            'تكامل مرن مع نماذج الذكاء الاصطناعي المخصصة يسمح باستخدام وتكامل نماذج الذكاء الاصطناعي الخاصة بالشركات حسب احتياجاتها.',
            'عرض مضغوط وواضح يوفر واجهة عرض مبسطة تمكن المستخدمين من متابعة المحتوى بفعالية.',
            'توافق مع تنسيقات Markdown دعم لتنسيق Markdown لكتابة وتنسيق الرسائل بمرونة.',
            'إمكانية تحديد أولوية الرسائل إمكانية تحديد أولويات الرسائل المهمة لتصل للمستخدمين في الوقت المناسب وبالأهمية المناسبة لكل حدث.',
            'إشعارات دائمة وفعّالة إشعارات تبقى مرئية حتى يتم الاطلاع عليها، لضمان متابعة جميع التحديثات الهامة.',
        ],
    },
    {
        id: '4',
        title: 'التحكم المتقدم في الوصول والأتمتة',
        description: [
            'مصادقة عبر البريد الإلكتروني ضمان أمان تسجيل الدخول من خلال مصادقة البريد الإلكتروني.',
            'تزامن المستخدمين عبر AD/LDAP تزامن مستمر بين المستخدمين في Active Directory و LDAP لضمان تحديث البيانات.',
            'تسجيل الدخول الأحادي باستخدام SAML 2.0، Entra ID، Okta، وغيرها يدعم تسجيل الدخول الموحد عبر بروتوكولات متعددة لسهولة الوصول.',
            'عرض مضغوط وواضح يوفر واجهة عرض مبسطة تمكن المستخدمين من متابعة المحتوى بفعالية.',
            'تطبيق المصادقة متعددة العوامل لحسابات البريد الإلكتروني وLDAP تعزيز الأمان بفرض التحقق الثنائي للوصول الآمن.',
            'إمكانية تحديد أولوية الرسائل إمكانية تحديد أولويات الرسائل المهمة لتصل للمستخدمين في الوقت المناسب وبالأهمية المناسبة لكل حدث.',
            'SSO باستخدام AD/LDAP، OpenID، وغيرها تكامل مع خدمات SSO لتمكين الوصول السلس عبر الأنظمة.',
            'التحكم المتقدم في الوصول إعدادات مرنة وشاملة للتحكم في الوصول وتخصيصه بناءً على احتياجات المؤسسة.',
        ],
    },
    {
        id: '5',
        title: 'التعاون بين الفرق المتعددة',
        description: [
            'مكالمات جماعية ومشاركة الشاشة تواصل فوري عبر المكالمات الجماعية ومشاركة الشاشة لتسهيل التفاعل والتنسيق.',
            'مجموعات مستخدمين مخصصة تنظيم المستخدمين في مجموعات خاصة لتعزيز العمل المنظم داخل الفرق.',
            'حسابات للضيوف دعم للضيوف من خارج الفريق لتوسيع نطاق التعاون وإشراك الأطراف الخارجية.',
            'إشعارات على مستوى النظام إرسال إشعارات شاملة إلى كافة أعضاء المنظمة لضمان اطلاع الجميع على المستجدات.',
        ],
    },
    {
        id: '12',
        title: 'التوسّع والتوفر العالي للخدمة ',
        description: [
            'نشر عالي التوافر مع بنية تجميعية يضمن بقاء الخدمة متاحة حتى عند حدوث مشكلات في بعض الخوادم.',
            'مراقبة أداء دقيقة ومستمرة مراقبة مستمرة للأداء لتجنب أي تراجع في الكفاءة.',
            'حبنية قابلة للتوسع أفقياً تتيح إضافة موارد جديدة بسهولة للتعامل مع زيادة الأحمال.',
            'تسجيل متقدم للأحداث التشغيلية يوفر تقارير وبيانات تفصيلية لمراقبة الأنشطة والتحليلات.',
            'بحث مؤسسي شامل (لأكثر من 3 ملايين مشاركة) نظام بحث قوي يلبي احتياجات المؤسسات الكبيرة.',
            'مكالمات ومشاركة شاشة قابلة للتوسع أفقيًا مع توافر عالٍ تضمن دعم عدد كبير من المستخدمين في نفس الوقت.',
            'دعم متكامل للنشر عبر Kubernetes يسمح بتشغيل التطبيق عبر Kubernetes للحصول على بيئة موثوقة وسهلة الإدارة.',
        ],
    },
    {
        id: '6',
        title: ' حلول الامتثال والإدارة المتقدمة للشركات',
        description: [
            'تزامن المجموعات والقنوات والفرق عبر AD/LDAP تسهيل عملية مزامنة المجموعات والقنوات والفرق لتبسيط إدارة الوصول وتحديثات العضوية. الحماية القانونية (Legal Hold) توفير أدوات لحفظ البيانات والمعلومات المطلوبة في حالة التحقيقات القانونية أو الامتثال.',
            'إدارة تفويضية دقيقة إمكانية توزيع الصلاحيات الإدارية على عدة مستويات، مما يتيح إدارة دقيقة وشاملة في المؤسسات الكبيرة.',
            'تسجيل متقدم للأحداث التشغيلية يوفر تقارير وبيانات تفصيلية لمراقبة الأنشطة والتحليلات.',
            'بحث مؤسسي شامل (لأكثر من 3 ملايين مشاركة) نظام بحث قوي يلبي احتياجات المؤسسات الكبيرة.',
            'تصدير الامتثال وأتمتة الاستكشاف الإلكتروني (eDiscovery) أتمتة عمليات تصدير البيانات واكتشاف الأدلة الرقمية وفقًا لمتطلبات الامتثال.',
            'سياسة الاحتفاظ بالبيانات ضبط السياسات الخاصة بفترات الاحتفاظ بالبيانات لضمان الامتثال للوائح القانونية وحماية البيانات.',
            'تصدير القنوات دعم تصدير محتوى القنوات للمراجعة أو الاحتفاظ أو الامتثال للوائح.',
            'شروط خدمة مخصصة للعميل إمكانية تخصيص شروط الخدمة التي يجب أن يوافق عليها العملاء، مما يسهل إدارة سياسات الخدمة والتوافق.',
        ],
    },
    {
        id: '7',
        title: 'التنقل المؤسسي المتكامل',
        description: [
            'دعم إدارة التنقل المؤسسي (AppConfig): يوفر القدرة على إدارة الأجهزة وتطبيقات المؤسسة بطريقة آمنة، مما يتيح التحكم والسيطرة على إعدادات التطبيقات والوصول الآمن للمعلومات على الأجهزة المتنقلة.',
            'تنقل خاص بإشعارات الدفع باستخدام هوية فقط (ID-only) يتيح تلقي الإشعارات على الأجهزة المتنقلة بشكل آمن من خلال إشعارات الدفع المعتمدة على الهوية فقط، مما يعزز خصوصية وسرية التنقل داخل المؤسسة.',
        ],
    },
    {
        id: '8',
        title: 'أتمتة سير العمل الذكي',
        description: [
            'كتيبات العمل التعاونية (Collaborative Playbooks): توفر هذه الميزة إمكانية إنشاء وتخصيص كتيبات عمل مخصصة لأتمتة سير العمل بين الفرق المختلفة. يتم تصميم كتيبات العمل هذه لتحديد خطوات العمل والمهام بوضوح، مما يسهل على الفرق اتباع الإجراءات المعيارية عند التعامل مع المهام المتكررة، مثل الاستجابة للحوادث أو إدارة إصدارات البرمجيات. من خلال هذا التوجه، تزداد سرعة العمليات ويقل معدل الخطأ البشري، مما يساهم في تحسين الكفاءة والإنتاجية بشكل عام.',

            'لوحات معلومات سير العمل (Workflow Dashboards): توفر هذه اللوحات رؤية شاملة حول تقدم سير العمل، حيث يمكن للفرق متابعة أداء العمليات المختلفة وتقييم النتائج بشكل فوري. تساعد هذه اللوحات في تحليل الأداء واتخاذ قرارات مستندة إلى البيانات لتحسين العمليات. على سبيل المثال، يمكن استخدامها لمراقبة وقت الاستجابة للمهام، والكشف عن التأخيرات، والعمل على تحسين تدفق العمل بناءً على التحليلات المتاحة.',
        ],
    },

    {
        id: '10',
        title: ' الاتصالات الموحدة والمشتركة بين مختلف المؤسسات',
        description: [
            'تكامل المراسلة مع Microsoft Teams تمكن هذه الميزة المؤسسات من دمج الرسائل مع منصة Microsoft Teams. من خلال هذا التكامل، يمكن للمستخدمين في Workspace إرسال واستقبال الرسائل مباشرةً من وإلى مستخدمي Microsoft Teams، مما يسهل التواصل ويزيل الحواجز بين الفرق التي تستخدم منصات مختلفة. هذه الميزة فعالة بشكل خاص في البيئات التي تعمل فيها المؤسسات مع شركاء خارجيين يستخدمون Microsoft Teams.',

            'قنوات مشتركة (تجريبي). هذه الميزة ما زالت في مرحلة الاختبار، لكنها تتيح للمستخدمين مشاركة قنوات محددة مع فرق خارجية، مما يسمح بالعمل التعاوني في قناة واحدة مشتركة دون الحاجة إلى تبديل المنصات أو الحسابات. على سبيل المثال، يمكن لفريق من مؤسسة A وفريق من مؤسسة B الوصول إلى قناة واحدة ومشاركة المعلومات والملفات بشكل مباشر.',
        ],
    },
    {
        id: '11',
        title: '  خيارات دعم متعددة تناسب احتياجات مختلف المستخدمين',
        description: [
            'دعم المجتمع (Community Support) متوفر في النسختين المجانية والاحترافية. يعتمد هذا النوع من الدعم على تفاعل مجتمع المستخدمين، حيث يمكن للمستخدمين طرح الأسئلة والحصول على إجابات ومشاركة المعلومات، لكنه لا يقدم دعماً مباشراً من الشركة.',

            'الدعم المؤسسي (Enterprise Support) يقتصر هذا الدعم على الإصدار المؤسسي، ويوفر خدمة متميزة تتضمن مساعدة تقنية موسعة ودعماً شاملاً للشركات والمؤسسات لضمان استمرار عملهم بسلاسة.',

            'الدعم الاحترافي (Professional Support) متاح في النسختين الاحترافية والمؤسسية. يقدم هذا الدعم مستوى أعلى من حيث المساعدة المباشرة والتوجيه الفني، ويشمل دعمًا رسميًا من فريق الشركة للمستخدمين الذين يحتاجون إلى مساعدة تقنية متقدمة.',

            'الدعم المتميز (Premier Support) هذا الخيار متاح للإصدار المؤسسي فقط، ويأتي كخيار إضافي (Option). يُعدّ هذا النوع من الدعم هو الأعلى مستوىً، حيث يقدم استجابة سريعة وخدمات مخصصة وشاملة لتلبية احتياجات الشركات الكبرى التي تتطلب مستويات أعلى من الرعاية الفنية والتدريب المستمر.',
        ],
    },
];

function FeaturesSection() {
    const [activeFeature, setActiveFeature] = useState(features[0]);

    return (
        <div className='app1'>
            <div className='containerHome'>
                <div className='header1'>
                    <h1 className='title1'> {'مميزات منصة مساحة عمل سوفا '}</h1>
                </div>

                <div className='content'>
                    <div className='features-list'>
                        {features.map((feature) => (
                            <SecurityFeature
                                key={feature.id}
                                title={feature.title}
                                description={feature.description.join(', ')} // Join for display in the feature list
                                isActive={activeFeature.id === feature.id}
                                onClick={() => setActiveFeature(feature)}
                            />
                        ))}
                    </div>
                    <div className='feature-display'>
                        <h3 className='description'>{activeFeature.title}</h3>
                        <ul className='feature-list'>
                            {activeFeature.description.map((desc, index) => (
                                <li key={index}>{desc}</li>
                            ))}
                        </ul>
                        <button className='learn-more'>{' اعرف المزيد '}</button>
                    </div>
                </div>
            </div>
        </div>
    );
}

export default FeaturesSection;
