// Copyright (c) 2015-present Workspace, Inc. All Rights Reserved.
// See LICENSE.txt for license information.

import React from 'react';

import img from '../../../images/chat.svg';
import img2 from '../../../images/power.svg';
import img1 from '../../../images/support.svg';
const Features = () => {
    return (
        <section
            id='features'
            className='features'
        >
            <div className='containerHome'>
                <div className='titleCard'>
                    <div
                        id='whyUs'
                        className='titleBox'
                    >
                        {'  لماذا تختار منصتنا'}
                    </div>
                </div>
                <h2 className='main-title'>
                    {'   حافظ على أمان وسلاسة تواصل شركتك مع منصتنا'}{' '}
                </h2>
                <p className='main-description'>
                    {' في عالم يعتمد على سرعة التواصل وأمانه، نقدم لك حلاً متكاملاً يساعدك في حماية بياناتك وتسهيل تواصل فريقك عبر منصتنا المتوفرة على جميع الأجهزة'}
                </p>

                <div className='features-grid'>
                    <div className='feature-card'>
                        <div className='iconCover'>
                            <img
                                src={img1}
                                className='icon'
                            />
                        </div>
                        <h3> {'دعم متواصل '}</h3>
                        <p>
                            {' حصل على دعم مستمر لضمان استقرار وأمان تواصلك الرقمي، مع تحديثات دورية لتلبية متطلباتك المتغيرة'}
                        </p>
                    </div>
                    <div className='feature-card'>
                        <div className='iconCover'>
                            <img
                                src={img2}
                                className='icon'
                            />
                        </div>
                        <h3> {'تقنيات متقدمة '}</h3>
                        <p>
                            {' من بروتوكولات الأمان المتقدمة إلى أدوات التشفير، نقدم لك أفضل  الحلول التقنية للحفاظ على بياناتك محمية'}
                        </p>
                    </div>
                    <div className='feature-card'>
                        <div className='iconCover'>
                            <img
                                src={img}
                                className='icon'
                            />
                        </div>
                        <h3> {'تواصل سهل وتفاعلي '}</h3>
                        <p>
                            {' تجربة تواصل مميزة تتيح لك مشاركة الرسائل والملفات في بيئة آمنة وسلسة، تلبي جميع احتياجاتك الاتصالية.'}
                        </p>
                    </div>
                </div>

                <div className='advanced-features'>
                    <h2 className='main-title'> {'التواصل الفوري والآمن '}</h2>
                    <p className='section-description'>
                        {'    مصممة لجميع الموظفين، تغطي هذه الدورات أساسيات الأمن المعلوماتي مثل إدارة كلمات المرور، والتعرف على هجمات التصيد الاحتيالي، وممارسات التصفح الآمن.'}
                    </p>

                    <div className='features-grid'>
                        <div className='feature-card'>
                            <h3>{' إرسال الرسائل '}</h3>
                            <p>
                                {'تمتع بإرسال الرسائل النصية بسرعة وأمان إلى أي جهة اتصال، حيث يتم تشفير جميع الرسائل لتوفير خصوصية كاملة. سواء كانت محادثات فردية أو جماعية، تمنحك منصتنا بيئة آمنة للتواصل دون القلق من تسربالمعلومات أو اختراق البيانات.'}
                            </p>
                        </div>
                        <div className='feature-card'>
                            <h3> {'مكالمات الصوت والفيديو '}</h3>
                            <p>
                                {'  يمكنك إجراء مكالمات صوتية ومرئية بجودة عالية مع أصدقائك وزملائك حول العالم. توفر منصتنا تقنية تشفير متقدمة لحماية المكالمات من التجسس، مما يسمح لك بالتحدث بحرية وأمان، وكأنك في نفس المكان مع الطرف الآخر.'}
                            </p>
                        </div>
                        <div className='feature-card'>
                            <h3>{' مشاركة الملفات والوسائط '}</h3>
                            <p>
                                {' شارك الصور، الفيديوهات، والوثائق بسهولة وأمان. نضمن حماية جميع الملفات المرسلة والمستلمة من التطفل، مما يسمح لك بتبادل المعلومات الهامة والوسائط الكبيرة دون القلق من انتهاك الخصوصية.'}
                            </p>
                        </div>
                        <div className='feature-card'>
                            <h3> {'الدردشات الجماعية الآمنة '}</h3>
                            <p>
                                {' اجمع فريقك في مجموعات دردشة آمنة تماماً. تمنحك منصتنا القدرة على إنشاء مجموعات لتبادل الأفكار والمعلومات بشكل آمن ومنظم، مما يعزز من إنتاجية فريقك ويضمن سرية المعلومات المتبادلة في المجموعة.'}
                            </p>
                        </div>
                        <div className='feature-card'>
                            <h3>{' أمان المحادثات في الوقت الحقيقي '}</h3>
                            <p>
                                {'بفضل تقنيات التشفير المتقدمة، تتيح لك منصتنا حماية محادثاتك وتواصلك الفوري في الوقت الحقيقي. نحن نحرص على أن تكون جميع المحادثات، من النصوص إلى الفيديو، محمية بالكامل من التدخلات الخارجية، لتتمكن من التواصل بثقة تامة.'}
                            </p>
                        </div>
                        <div className='feature-card'>
                            <h3>{' التشفير من الطرف إلى الطرف '}</h3>
                            <p>
                                {'  كل رسالة، مكالمة، وملف يتم إرساله عبر منصتنا مشفر من الطرف إلى الطرف، مما يعني أن المحتوى الخاص بك لا يمكن لأحد الاطلاع عليه إلا الطرفين المتواصلين. نأخذ خصوصيتك على محمل الجد لضمان تجربة تواصل آمنة.'}
                            </p>
                        </div>
                        <div className='feature-card'>
                            <h3> {'تنبيهات الأمان والخصوصية '}</h3>
                            <p>
                                {' استمتع بخيارات مخصصة للتحكم في خصوصيتك، مع تنبيهات أمان فورية. عند حدوث أي نشاط مشبوه أو محاولة اختراق، ستصلك إشعارات فورية لتحافظ على أمان حسابك ومحادثاتك.'}
                            </p>
                        </div>
                        <div className='feature-card'>
                            <h3> {'الرسائل المؤقتة وحذف الرسائل '}</h3>
                            <p>
                                {' نوفر لك خاصية الرسائل المؤقتة وحذف الرسائل المرسلة لتتمكن من التحكم بمعلوماتك. يمكنك ضبط الرسائل لتختفي تلقائياً بعد وقت معين، مما يعزز من خصوصيتك ويضمن عدم بقاء أي معلومات حساسة لفترةطويلة.'}
                            </p>
                        </div>
                        <div className='feature-card'>
                            <h3> {'سبورة بيضاء تفاعلية '}</h3>
                            <p>
                                {' السبورة البيضاء الإلكترونية هي أداة حديثة تستخدم في التعليم والاجتماعات. تتميز بالقدرة على الكتابة والرسم رقميًا، وتتيح التفاعل مع المحتوى عبر اللمس أو الأقلام الخاصة. يمكن ربطها بأجهزة الكمبيوتر لعرض المحتوى ومشاركة الشاشات، مما يعزز التعاون. كما توفر أدوات وقوالب متنوعة، وتسمح بتخزين المحتوى ومشاركته بسهولة.'}
                            </p>
                        </div>
                    </div>
                </div>
            </div>
        </section>
    );
};

export default Features;
