// Copyright (c) 2015-present Workspace, Inc. All Rights Reserved.
// See LICENSE.txt for license information.

import React from 'react';
import styled from 'styled-components';

import img2 from '../../../images/ML/Frame 1707479727.png';
import img1 from '../../../images/ML/Group 1707478190.png';
import img3 from '../../../images/ML/Group 1707478191.png';
import img4 from '../../../images/ML/Group 1707478192.png';
import img5 from '../../../images/ML/Group 1707478193.png';
import img7 from '../../../images/ML/Group 1707478203.png';
import img8 from '../../../images/ML/Group 1707478204.png';
import img9 from '../../../images/ML/Group 1707478205.png';
import img6 from '../../../images/ML/OverLay.png';
import img10 from '../../../images/ML/OverLay1.png';
import Carousel from '../components/Carousel/Carousel';
import type {CardData} from '../types/carousel.types';
const AppContainer = styled.div`
  width: 100%;
//   height: 80vh;
  position: relative;
  overflow: hidden;
`;

const sampleCards: CardData[] = [
    {
        id: 1,
        image: img7,
        title: 'الاتصالات الموحدة والمشتركة بين مختلف المؤسسات',
        descriptions: [
            `مجموعات مشتركة (تجريبي:)
    ميزة تحت الاختبار تتيح مشاركة مجموعات محددة مع فرق خارجية، مما يتيح تعاونًا مباشراً في مجموعة واحدة دون تبديل المنصات أو الحسابات، حيث يمكن لفريقين
    من مؤسستين مختلفتين مشاركة المعلومات والملفات بسلاسة.
    `,
            `تكامل المراسلة مع Teams :Microsoft
    يتيح للمؤسسات دمج الرسائل مع منصة Teams Microsoft، حيث يمكن لمستخدمي مساحة عمل سوفا التواصل مباشرة مع مستخدمي Teams Microsoft، مما
    يسهل التفاعل ويزيل الحواجز بين الفرق التى تعتمد منصات مختلفة، خاصة عند التعاون مع شركاء خارجيين.
    `,
        ],
    },
    {
        id: 2,
        image: img3,
        title: `منصة تواصل تعتمد المجموعات وتناسب الويب والهواتف.
`,
        descriptions: [
            'محرك بحث ذكي :وصول فوري للمحتوى والمعلومات داخل المحادثات.',
            `
مراسلة متعددة الوسائط :تواصل سلس ومشاركة للملفات والروابط عبر جميع
الأجهزة.
`,
            `مكالمات صوتية ودعم مشاركة الشاشة :تفاعل مباشر للاجتماعات والعروض التقديمية.
`,
            `
تخصيص الهوية البصرية :مرونة في تصميم الواجهة لتناسب طابع المؤسسة.
`,
            `
تنظيم المناقشات المتسلسلة :تتبع منظم للنقاشات والمواضيع.
`,
            `
دعم عالمي متعدد اللغات :متوفر بـ 20 لغة للوصول الشامل.
`,
        ],
    },
    {
        id: 3,
        image: img10,
        title: 'بيئة تعاون ذكية مدعومة بالذكاء الاصطناعي',
        descriptions: [
            `
ذكاء اصطناعي آمن (DDIL): تشغيل مؤمن يحمي البيانات الحساسة.`,
            `
روبوتات تفاعلية ذكية :مساعدات ذكية لتحسين التواصل والإنتاجية.`,
            `إحاطات فورية :تحديثات تلقائية للمستجدات.
`,
            `تكامل مع نماذج مخصصة :دمج مرن لنماذج الذكاء الاصطناعي حسب احتياجات
الشركات.

`,
            `
استفسارات محمية :دعم آمن للاستعلامات دون خرق الخصوصية

`,
            `تلخيص سياقي للمحتوى :أدوات لتلخيص وتنسيق المحتوى وفقاً لسياق المحادثات.
`,
            `وضع التتبع الكامل الاختياري (تجريبي.)

يقدم خياراً لتتبع شامل لمزيد من التحكم والتحليل التجريبي.
`,
        ],
    },
    {
        id: 4,
        image: img6,
        title: '           الدعم والتكامل التشغيلي والتقني',
        descriptions: [
            `تكامل متقدم مع DevOps: دعم مباشر لتكامل سلس ومستدام مع أنظمة
DevOps

`,
            `منصة تكامل متعددة الاستخدامات :تربط النظام الأساسي بأدوات العمل لتعزيز
التعاون.

`,
            `توافق مع Markdown: مرونة في تنسيق الرسائل باستخدام تنسيقات
Markdown
`,
            `إشعارات دائمة وفعالة :إشعارات مرئية تضمن متابعة التحديثات المهمة بشكل
فوري.

`,
            `عرض مضغوط وواضح :واجهة مبسطة تتيح متابعة المحتوى بفعالية.
`,
            `تحديد أولوية الرسائل :تميز الرسائل المهمة لتصل في الوقت المناسب وبالأهمية اللازمة.
`,
        ],
    },
    {
        id: 5,
        image: img8,
        title: 'التحكم المتقدم في الوصول والأتمتة',
        descriptions: [
            `
    تزامن المستخدمين عبر AD/LDAP: تحديث مستمر لمعلومات المستخدمين بين
    LDAP.وActive Directory

    `,
            `مصادقة عبر البريد الإلكتروني :تأمين تسجيل الدخول باستخدام التحقق عبر البر يد
    الإلكتروني.
    `,
            'تسجيل الدخول الأحادي (SSO) عبر 2.0 SAML و ID Entraو Okta:دعم متعدد البروتوكولات لتسهيل الوصول.',
            'تحكم متقدم في الوصول :إعدادات مرنة للتحكم وتخصيص الوصول حسب احتياجات المؤسسة.',
            'SSO باستخدام AD/LDAP و OpenID:تكامل مع خدمات SSO لتمكين وصول سلس عبر الأنظمة.',
        ],
    },
    {
        id: 6,
        image: img5,
        title: ' التعاون بين الفرق المتعددة',
        descriptions: [
            'مجموعات مستخدمين مخصصة تنظيم مرن يعزز التنسيق داخل الفرق.',
            'مكالمات جماعية ومشاركة الشاشة :تفاعل فوري يعزز التنسيق الفعال.',
            `إشعارات على مستوى النظام
إرسال إشعارات شاملة إلى كافة أعضاء المنظمة لضمان اطلاع الجميع فوراً على المستجدات.
`,
            `حسابات ضيوف :تعاون موسع يشمل الأطراف الخارجية بمرونة.
`,
        ],
    },
    {
        id: 7,
        image: img4,
        title: 'التوسع والتوفر العالي للخدمة',
        descriptions: [
            `مراقبة أداء دقيقة ومستمرة

مراقبة مستمرة للأداء لتجنب أي تراجع في الكفاءة

            `,
            `
            نشر عالي التوافر مع بنية تجميعية

يضمن بقاء الخدمة متاحة حتى عند حدوث مشكلات في بعض الخوادم.

            `,
            `تسجيل متقدم للأحداث التشغيلية

يوفر تقار ير وبيانات تفصيلية لمراقبة الأنشطة والتحليلات.

            `,
            `بنية قابلة للتوسع أفقياً

تتيح إضافة موارد جديدة بسهولة للتعامل مع زيادة الأحمال.

            `,
            'مكالمات ومشاركة شاشة قابلة للتوسع أفقياً مع توافر عال تضمن دعم عدد كبير من المستخدمين في نفس الوقت.',
            'بحث مؤسسي شامل (لأكثر من 3 ملايين مشاركة) نظام بحث قوي يلبي احتياجات المؤسسات الكبيرة.',
            `دعم متكامل للنشر عبر Kubernetes

يسمح بتشغيل التطبيق عبر Kubernetes للحصول على بيئة موثوقة وسهلة الإدارة.
`,
        ],
    },
    {
        id: 8,
        image: img9,
        title: ' حلول الامتثال والإدارة المتقدمة للشركات',
        descriptions: [
            `الحماية القانونية (Legal Hold)

توفير أدوات لحفظ البيانات والمعلومات المطلوبة في حالة التحقيقات القانونية أو الامتثال.

`,
            `
            تزامن المجموعات والمجموعات والفرق عبر AD/LDAP

تسهيل عملية مزامنة المجموعات والمجموعات والفرق لتبسيط إدارة الوصول وتحديثات العضوية.

`,
            `تصدير الامتثال وأتمتة الاستكشاف الإلكتروني(eDiscovery)
أتمتة عمليات تصدير البيانات واكتشاف الأدلة الرقمية وفقاً لمتطلبات الامتثال

`,
            `إدارة تفويضية دقيقة
إمكانية توزيع الصلاحيات الإدار ية على عدة مستويات، مما يتيح إدارة دقيقة وشاملة في المؤسسات الكبيرة.

`,
            `
سياسة الاحتفاظ بالبيانات
ضبط السياسات انجاصة بفترات الاحتفاظ بالبيانات لضمان الامتثال للوائح القانونية وحماية البيانات.
تصدير المجموعات

دعم تصدير محتوى المجموعات للمراجعة أو الاحتفاظ أو الامتثال للوائح.
`,
            `تصدير المجموعات

دعم تصدير محتوى المجموعات للمراجعة أو الاحتفاظ أو الامتثال للوائح.

`,
            `سياسة الاحتفاظ بالبيانات
ضبط السياسات الخاصة بفترات الاحتفاظ بالبيانات لضمان الامتثال للوائح القانونية وحماية البيانات.

`,
            `شروط خدمة مخصصة للعميل

إمكانية تخصيص شروط الخدمة التي يجب أن يوافق عليها العملاء، مما يسهل إدارة سياسات الخدمة والتوافق
`,
        ],
    },
    {
        id: 9,
        image: img2,
        title: 'التنقل المؤسسي المتكامل',
        descriptions: [
            `تنقل بإشعارات دفع معتمدة على الهوية:

استقبال آمن للإشعارات على الأجهزة المتنقلة باستخدام هوية فقط، مما يعزز خصوصية وسرية التنقل المؤسسي.

`,
            `دعم إدارة التنقل المؤسسي :(AppConfig)

يتيح إدارة آمنة للأجهزة والتطبيقات المؤسسية، مع تحكم كامل في إعدادات التطبيقات وضمان وصول آمن للمعلومات على الأجهزة المتنقلة.

`,
        ],
    },
    {
        id: 10,
        image: img1,
        title: 'أتمتة سير العمل الذكي',
        descriptions: [
            `لوحات معلومات سير العمل (Dashboards Workflow) .
تقدم رؤية شاملة لتقدم العمل، مما يمكّن الفرق من متابعة الأداء وتقييم النتائج بشكل فوري. تساعد في تحليل الأداء، كشف التأخيرات، واتخاذ قرارات مدعومة
بالبيانات لتحسين تدفق العمليات ورفع الكفاءة.

`,
            `
كتيبات العمل التعاونية:

تتيح إنشاء كتيبات مخصصة لأتمتة سير العمل بين الفرق، مع خطوات واضحة للمهام المتكررة كإدارة الحوادث أو إصدارات البرمجيات. تعزز هذه الكتيبات
سرعة العمليات وتقلل الأخطاء البشرية، مما يحسن الكفاءة والإنتاجية.

`,
        ],
    },
];

function Silder() {
    return (
        <AppContainer>
            {/* <div className="titleCard">
        <div className="titleBox"> مميزات مساحة عمل سوفا </div>
      </div>{" "} */}
            <Carousel cards={sampleCards}/>
        </AppContainer>
    );
}

export default Silder;
